#ifndef VX_PARAM_EXT_H
#define VX_PARAM_EXT_H

/**PARAM外部接口**/


/************************************************
 * 功能： 初始化本地变量
 * 
 * 参数： pCmdInfo, 指令收/发结构体
 * 		 pParam， 机器常数内存块首地址
 * 		 iParamSize， 机器常数内存块的 size
 * 		 pUnlock 是否可写判断依据数据的首地址
 * 		 
 * 返回： 0，执行成功；其他，异常码 
 *  
 * **********************************************/
extern int ParamProcInitial(void *pCmdInfo, void *pParam,  int iParamSize, void *pUnlock);



/************************************************
 * 功能： 对外处理 param 指令函数， 无时间限制
 * 
 * 返回： 0，执行成功；其他，异常码 
 *  
 * **********************************************/
extern int ParamProc(void);



/************************************************
 * 功能： 处理指令函数， 要求时间限制,ISR
 * 
 * 返回： 0，执行成功；其他，异常码 
 *  
 * **********************************************/
extern int ParamProcIsr();



/*****************************************************************************
* int ParamProcess(void)
* 函数说明：大文件可写判断、写完判断；
* 参数：          
* 返回：      
*          0  - success
*          !0 - error
* 调用：         无；
* 被调用：    shell下直接调用,ISR
******************************************************************************/
extern int ParamProcess();



/*****************************************************************************
* int ParamPart1Process(void)
* 函数说明：大文件写到机器常数存储区；
* 参数：          
* 返回：      
*          0  - success
*          !0 - error
* 调用：         无；
* 被调用：    shell下直接调用,ISR
******************************************************************************/
extern int ParamPart1Process();




#endif
